analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32662/Include/max32662.svd
   </registers>
  </peripheral>
<!--AES AES Keys.-->
  <peripheral>
   <name>CAN0</name>
   <description>Controller Area Network Registers</description>
   <baseAddress>0x40064000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>MODE</name>
     <description>Mode Register.</description>
     <addressOffset>0x0000</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>AFM</name>
       <description>Hardware acceptance filter scheme.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>LOM</name>
       <description>Listen Only Mode.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RST</name>
       <description>Reset Mode.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RXTRIG</name>
       <description>Receive FIFO trigger in 32bit word.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>1W</name>
         <description>1 word</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>4W</name>
         <description>4 word</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>8W</name>
         <description>8 word</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>16W</name>
         <description>16 word</description>
         <value>3</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>32W</name>
         <description>32 word</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>64W</name>
         <description>64 word</description>
         <value>5</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DMA</name>
       <description>Enable DMA mode.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SLP</name>
       <description>Sleep mode.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>enter</name>
         <description>Enter sleep mode.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>leave</name>
         <description>Leave sleep mode.</description>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>CMD</name>
     <description>Command Register.</description>
     <addressOffset>0x0001</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>ABORT</name>
       <description>Abort Transmission</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TXREQ</name>
       <description>Transmit Request.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>STAT</name>
     <description>Status Register.</description>
     <addressOffset>0x0002</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>BUS_OFF</name>
       <description>Bus off Status.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERR</name>
       <description>Error Status.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TX</name>
       <description>Transmit Status.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RX</name>
       <description>Receive Status.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TXBUF</name>
       <description>Transmit Buffer Status.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DOR</name>
       <description>Data Overrun Status.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RXBUF</name>
       <description>Receive Buffer Status.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>INTFL</name>
     <description>Interrupt Status Register.</description>
     <addressOffset>0x0003</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DOR</name>
       <description>Data Overrun Interrupt.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BERR</name>
       <description>Bus Error Interrupt.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TX</name>
       <description>Transmission Interrupt.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RX</name>
       <description>Receive Interrupt.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERPSV</name>
       <description>Error Passive Interrupt.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERWARN</name>
       <description>Error Warning Interrupt.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AL</name>
       <description>Arbitration Lost Interrupt.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>WU</name>
       <description>Wake-up Interrupt.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>INTEN</name>
     <description>Interrupt Enable Register.</description>
     <addressOffset>0x0004</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DOR</name>
       <description>Data Overrun Interrupt.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BERR</name>
       <description>Bus Error Interrupt.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TX</name>
       <description>Transmit Interrupt.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RX</name>
       <description>Receive Interrupt.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERPSV</name>
       <description>Error Passive Interrupt.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERWARN</name>
       <description>Error Warning Interrupt.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AL</name>
       <description>Arbitration Lost Interrupt.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>WU</name>
       <description>Wakeup interrupt.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RMC</name>
     <description>Receive Message Counter Register.</description>
     <addressOffset>0x0005</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>NUM_MSGS</name>
       <description>Number of stored message frames.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BUSTIM0</name>
     <description>Bus Timing Register 0.</description>
     <addressOffset>0x0006</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>BR_CLKDIV</name>
       <description>Baud Rate Prescaler.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>SJW</name>
       <description>Synchronization Jump Width.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BUSTIM1</name>
     <description>Bus Timing Register 1.</description>
     <addressOffset>0x0007</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>TSEG1</name>
       <description>Number of clock cycles per Time Segment 1</description>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>TSEG2</name>
       <description>Number of clock cycles per Time Segment 2</description>
       <bitOffset>4</bitOffset>
       <bitWidth>3</bitWidth>
      </field>
      <field>
       <name>SAM</name>
       <description>Number of bus level samples.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TXFIFO32</name>
     <description>Transmit FIFO Register.</description>
     <addressOffset>0x0008</addressOffset>
     <size>32</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Write to put into TX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>2</dim>
     <dimIncrement>2</dimIncrement>
     <name>TXFIFO16[%s]</name>
     <description>Transmit FIFO Register.</description>
     <addressOffset>0x0008</addressOffset>
     <size>16</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Write to put into TX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>1</dimIncrement>
     <name>TXFIFO8[%s]</name>
     <description>Transmit FIFO Register.</description>
     <addressOffset>0x0008</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Write to put into TX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RXFIFO32</name>
     <description>Receive FIFO Register.</description>
     <addressOffset>0x000C</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read from RX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>2</dim>
     <dimIncrement>2</dimIncrement>
     <name>RXFIFO16[%s]</name>
     <description>Receive FIFO Register.</description>
     <addressOffset>0x000C</addressOffset>
     <size>16</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read from RX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>1</dimIncrement>
     <name>RXFIFO8[%s]</name>
     <description>Receive FIFO Register.</description>
     <addressOffset>0x000C</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Read from RX FIFO.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ACR32</name>
     <description>Acceptance Code Register.</description>
     <addressOffset>0x0010</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>ACR</name>
       <description>Acceptance Code.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>2</dim>
     <dimIncrement>2</dimIncrement>
     <name>ACR16[%s]</name>
     <description>Acceptance Code Register.</description>
     <addressOffset>0x0010</addressOffset>
     <size>16</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>ACR</name>
       <description>Acceptance Code.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>1</dimIncrement>
     <name>ACR8[%s]</name>
     <description>Acceptance Code Register.</description>
     <addressOffset>0x0010</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>ACR</name>
       <description>Acceptance Code.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AMR32</name>
     <description>Acceptance Mask Register.</description>
     <addressOffset>0x0014</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>AMR</name>
       <description>Acceptance Mask.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>2</dim>
     <dimIncrement>2</dimIncrement>
     <name>AMR16[%s]</name>
     <description>Acceptance Mask Register.</description>
     <addressOffset>0x0014</addressOffset>
     <size>16</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>AMR</name>
       <description>Acceptance Mask.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <dim>4</dim>
     <dimIncrement>1</dimIncrement>
     <name>AMR8[%s]</name>
     <description>Acceptance Mask Register.</description>
     <addressOffset>0x0014</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>AMR</name>
       <description>Acceptance Mask.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ECC</name>
     <description>Error Code Capture Register.</description>
     <addressOffset>0x0018</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>BER</name>
       <description>Bit Error Occurred.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>STFER</name>
       <description>Stuff Error Occurred.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>CRCER</name>
       <description>CRC Error Occurred.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>FRMER</name>
       <description>Form Error Occurred.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ACKER</name>
       <description>ACK Error Occurred.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>EDIR</name>
       <description>Direction of transfer while error occurred.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>TX</name>
         <description>Transmission</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RX</name>
         <description>Reception</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TXWRN</name>
       <description>Set when TXERR counter is greater than or equal to 96.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RXWRN</name>
       <description>Set when RXERR counter is greater than or equal to 96.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RXERR</name>
     <description>Receive Error Counter.</description>
     <addressOffset>0x0019</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>RXERR</name>
       <description>Receive Error Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TXERR</name>
     <description>Invalidate All Registers.</description>
     <addressOffset>0x001A</addressOffset>
     <size>8</size>
     <access>read-write</access>
     <fields>
      <field>
       <name>TXERR</name>
       <description>Transmit Error Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ALC</name>
     <description>Arbitration Lost Code Capture Register.</description>
     <addressOffset>0x001B</addressOffset>
     <size>8</size>
     <access>read-only</access>
     <fields>
      <field>
       <name>ALC</name>
       <description>Arbitration Lost Capture.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>NBT</name>
     <description>Nominal Bit Timing Register.</description>
     <addressOffset>0x001C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>NBRP</name>
       <description>Baudrate Prescaler Used in Arbitration Phase.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
      </field>
      <field>
       <name>NSEG1</name>
       <description>The time segment before the sample point in Abritration Phase.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>NSEG2</name>
       <description>The time segment after the sample point in Abritration Phase.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>NSJW</name>
       <description>Synchronization Jump Width in Arbitration Phase.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>DBT_SSPP</name>
     <description>Data Bit Timing Register.</description>
     <addressOffset>0x0020</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>DBRP</name>
       <description>Baudrate Prescaler in Data Phase.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>10</bitWidth>
      </field>
      <field>
       <name>DSEG1</name>
       <description>The time segment before the sample point in Data Phase.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>DSEG2</name>
       <description>The time segment before the sample point in Data Phase.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>DSJW</name>
       <description>Synchronization Jump Width in Data Phase</description>
       <bitOffset>20</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>SSPP</name>
       <description>Position of the secondary sample point.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
     </fields>
    </register>
