analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32662/Include/max32662.svd
   </registers>
  </peripheral>
<!--I2S Inter-IC Sound Interface.-->
  <peripheral>
   <name>ICC0</name>
   <description>Instruction Cache Controller Registers</description>
   <baseAddress>0x4002A000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x800</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>INFO</name>
     <description>Cache ID Register.</description>
     <addressOffset>0x0000</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>RELNUM</name>
       <description>Release Number. Identifies the RTL release version.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>PARTNUM</name>
       <description>Part Number. This field reflects the value of C_ID_PART_NUMBER configuration parameter.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>ID</name>
       <description>Cache ID. This field reflects the value of the C_ID_CACHEID configuration parameter.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SZ</name>
     <description>Memory Configuration Register.</description>
     <addressOffset>0x0004</addressOffset>
     <access>read-only</access>
     <resetValue>0x00080008</resetValue>
     <fields>
      <field>
       <name>CCH</name>
       <description>Cache Size. Indicates total size in Kbytes of cache.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
      <field>
       <name>MEM</name>
       <description>Main Memory Size. Indicates the total size, in units of 128 Kbytes, of code memory accessible to the cache controller.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CTRL</name>
     <description>Cache Control and Status Register.</description>
     <addressOffset>0x0100</addressOffset>
     <fields>
      <field>
       <name>EN</name>
       <description>Cache Enable. Controls whether the cache is bypassed or is in use. Changing the state of this bit will cause the instruction cache to be flushed and its contents invalidated.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Cache Bypassed. Instruction data is stored in the line fill buffer but is not written to main cache memory array.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Cache Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RDY</name>
       <description>Cache Ready flag. Cleared by hardware when at any time the cache as a whole is invalidated (including a system reset). When this bit is 0, the cache is effectively in bypass mode (instruction fetches will come from main memory or from the line fill buffer). Set by hardware when the invalidate operation is complete and the cache is ready.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>notReady</name>
         <description>Not Ready.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ready</name>
         <description>Ready.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INVALIDATE</name>
     <description>Invalidate All Registers.</description>
     <addressOffset>0x0700</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>INVALID</name>
       <description>Invalidate.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--ICC0 Instruction Cache Controller Registers-->
  <peripheral>
   <name>MCR</name>
   <description>Misc Control.</description>
   <baseAddress>0x40106C00</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>RST</name>
     <description>Reset Register.</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>TMR3</name>
       <description>TMR3 (LPTMR0) Reset. Setting this bit to 1 resets TMR3 (LPTMR0) block.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RTC</name>
       <description>Real Time Clock Reset.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CLKCTRL</name>
     <description>System CLock Control Register.</description>
     <addressOffset>0x08</addressOffset>
     <fields>
      <field>
       <name>ERTCO_PD</name>
       <description>32kHz Crystal Oscillator Power Down. Setting this bit powers down the ERTCO analog circuitry.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERTCO_EN</name>
       <description>32kHz Crystal Oscillator Enable.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AINCOMP</name>
     <description>AIN Comparator Control Register.</description>
     <addressOffset>0x0C</addressOffset>
     <fields>
      <field>
       <name>PD</name>
       <description>AIN Compatator Power Down control. Before AIN Comparator is powered on, the positive and negative inputs selects for the comparator should be configured.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>HYST</name>
       <description>AIN Comparator Hysteresis control.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>NSEL_COMP0</name>
       <description>Negative input select for Comparator 0. No more than 1 input channel can be selected at any time. Corresponding GPIO must be configured for AF4.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>PSEL_COMP0</name>
       <description>Positive input select for AIN Comparator 0. No more than 1 input channel can be selected at any time. Corresponding GPIO must be configured for AF4.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>NSEL_COMP1</name>
       <description>Negative input select for Comparator 1. No more than 1 input channel can be selected at any time. Corresponding GPIO must be configured for AF4.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>PSEL_COMP1</name>
       <description>Positive input select for AIN Comparator 1. No more than 1 input channel can be selected at any time. Corresponding GPIO must be configured for AF4.</description>
       <bitOffset>28</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>LPPIOCTRL</name>
     <description>Low Power Peripheral IO Control Register.</description>
     <addressOffset>0x10</addressOffset>
     <fields>
      <field>
       <name>TMR3_IN</name>
       <description>Enable control for TMR3 (LPTMR0) input. If enabled, the associated GPIO 
input is connected to the peripheral; otherwise the input to the 
peripheral is forced low.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TMR3_OUT</name>
       <description>Enable control for LPTMR0 output. If enabled and peripheral clock 
also enabled (PCLKDIS.LPTMR0), the peripheral output controls the 
associated GPIO in output mode; otherwise GPIO control comes 
from GPIO control module.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TMR3_OUT_N</name>
       <description>Enable control for TMR3 (LPTMR0) complementary output. If enabled and 
peripheral clock also enabled (PCLKDIS.TMR3), the peripheral 
output controls the associated GPIO in output mode; otherwise GPIO 
control comes from GPIO control module</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PCLKDIS</name>
     <description>Peripheral Clock Disable Register.</description>
     <addressOffset>0x24</addressOffset>
     <fields>
      <field>
       <name>TMR3</name>
       <description>TMR3 (LPTMR0) Clock Disable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AESKEY</name>
     <description>AES Key Pointer and Status Register.</description>
     <addressOffset>0x34</addressOffset>
     <fields>
      <field>
       <name>PTR</name>
       <description>AES Key Pointer/Status</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADCCFG0</name>
     <description>ADC Config Register 0.</description>
     <addressOffset>0x38</addressOffset>
     <fields>
      <field>
       <name>LP_EXTCLK_EN</name>
       <description>Enable input driver for LP External Clock.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>EXT_REF</name>
       <description>External Reference Select.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>INT_REF</name>
       <description>Internal Reference Select Option, when not using External Reference.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADCCFG1</name>
     <description>ADC Config Register 1.</description>
     <addressOffset>0x3C</addressOffset>
     <fields>
      <field>
       <name>THRU_PAD_SW_EN</name>
       <description>Enable the MUX switch, switch placed in padring, used in the buffer path. Each pad has a separate THRU_PAD_SW_EN signal.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>AIN_INP_EN</name>
       <description>AIN Input Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>THRU_EN</name>
       <description>Enable the MUX switches, switch placed in analog_sys, used in the buffer path.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AMP_EN</name>
       <description>Enable the buffer amplifier used in the buffer path.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AMP_RRI_EN</name>
       <description>Enable the buffer amplifier to operatore for Rail to Rail Input, Active High. If it is low, only NMOS Input pair will be operating which would restrict the range,</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DIVSEL</name>
       <description>Select one of the three different signal paths.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>ADCCFG2</name>
     <description>ADC Config Register 2.</description>
     <addressOffset>0x40</addressOffset>
     <fields>
      <field>
       <name>VREFM</name>
       <description>Trimming code for VREFM output of reference buffer.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>VREFP</name>
       <description>Trimming code for VREFP output of reference buffer.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>7</bitWidth>
      </field>
      <field>
       <name>IDRV</name>
       <description>Trimming code for reference buffer drive strength.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>VCM</name>
       <description>Trimming code for VCM output of reference buffer.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>D_IBOOST</name>
       <description>Trimming value for extra drive current in reference buffer outputs</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
