analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32662/Include/max32662.svd
   </registers>
  </peripheral>
<!--TMR Low-Power Configurable Timer-->
  <peripheral derivedFrom="TMR">
   <name>TMR1</name>
   <description>Low-Power Configurable Timer 1</description>
   <baseAddress>0x40011000</baseAddress>
   <interrupt>
    <name>TMR1</name>
    <description>TMR1 IRQ</description>
    <value>6</value>
   </interrupt>
  </peripheral>
<!--TMR1 Low-Power Configurable Timer 1-->
  <peripheral derivedFrom="TMR">
   <name>TMR2</name>
   <description>Low-Power Configurable Timer 2</description>
   <baseAddress>0x40012000</baseAddress>
   <interrupt>
    <name>TMR2</name>
    <description>TMR2 IRQ</description>
    <value>7</value>
   </interrupt>
  </peripheral>
<!--TMR2 Low-Power Configurable Timer 2-->
  <peripheral derivedFrom="TMR">
   <name>TMR3</name>
   <description>Low-Power Configurable Timer 3</description>
   <baseAddress>0x40013000</baseAddress>
   <interrupt>
    <name>TMR3</name>
    <description>TMR3 IRQ</description>
    <value>8</value>
   </interrupt>
  </peripheral>
<!--TMR3 Low-Power Configurable Timer 3-->
  <peripheral>
   <name>TRIMSIR</name>
   <description>Trim System Initilazation Registers</description>
   <baseAddress>0x40105400</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>BB_SIR2</name>
     <description>System Init. Configuration Register 2.</description>
     <addressOffset>0x08</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>TRIM_IBRO_RBIAS</name>
       <description>HIRC8M Trim</description>
       <bitOffset>0</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
      <field>
       <name>RAM0_1ECCEN</name>
       <description>RAM 0 and RAM 1 ECC Enable</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>ECC Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>ECC Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field derivedFrom="RAM0_1ECCEN">
       <name>RAM2ECCEN</name>
       <description>RAM 2 ECC Enable</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0_1ECCEN">
       <name>RAM3ECCEN</name>
       <description>RAM 3 ECC Enable</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0_1ECCEN">
       <name>ICC0ECCEN</name>
       <description>ICC 0 ECC Enable</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0_1ECCEN">
       <name>FL0ECCEN</name>
       <description>Flash 0 ECC Enable</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field derivedFrom="RAM0_1ECCEN">
       <name>FL1ECCEN</name>
       <description>Flash 1 ECC Enable</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TRIM_IBRO</name>
       <description>HIRC8M Trim</description>
       <bitOffset>16</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>BB_SIR3</name>
     <description>System Init. Configuration Register 3.</description>
     <addressOffset>0x0C</addressOffset>
     <access>read-write</access>
    </register>
    <register>
     <name>BB_SIR6</name>
     <description>System Init. Configuration Register 6.</description>
     <addressOffset>0x18</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>RTCX1TRIM</name>
       <description>RTCX1 Trim</description>
       <bitOffset>4</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
      <field>
       <name>RTCX2TRIM</name>
       <description>RTCX2 Trim</description>
       <bitOffset>9</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
     </fields>
    </register>
   </registers>
  </peripheral>
<!--TRIMSIR Trim System Initilazation Registers-->
  <peripheral>
   <name>TRNG</name>
   <description>Random Number Generator.</description>
   <baseAddress>0x4004D000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>TRNG</name>
    <description>TRNG interrupt.</description>
    <value>4</value>
   </interrupt>
   <registers>
    <register>
     <name>CTRL</name>
     <description>TRNG Control Register.</description>
     <addressOffset>0x00</addressOffset>
     <resetValue>0x00000003</resetValue>
     <fields>
      <field>
       <name>RND_IE</name>
       <description>To enable IRQ generation when a new 32-bit Random number is ready.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>disable</name>
         <description>Disable</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>enable</name>
         <description>Enable</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>KEYGEN</name>
       <description>AES Key Generate. When enabled, the key for securing NVSRAM is generated and transferred to the secure key register automatically without user visibility or intervention. This bit is cleared by hardware once the key has been transferred to the secure key register.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>KEYWIPE</name>
       <description>To wipe the Battery Backed key.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>STATUS</name>
     <description>Data. The content of this register is valid only when RNG_IS = 1. When TRNG is disabled, read returns 0x0000 0000.</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>RDY</name>
       <description>32-bit random data is ready to read from TRNG_DATA register. Reading TRNG_DATA when RND_RDY=0 will return all 0's. IRQ is generated when RND_RDY=1 if TRNG_CN.RND_IRQ_EN=1.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>Busy</name>
         <description>TRNG Busy</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Ready</name>
         <description>32 bit random data is ready</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>DATA</name>
     <description>Data. The content of this register is valid only when RNG_IS = 1. When TRNG is disabled, read returns 0x0000 0000.</description>
     <addressOffset>0x08</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data. The content of this register is valid only when RNG_IS =1. When TNRG is disabled, read returns 0x0000 0000.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
